BellerageHackathon/src/Documents/РезультатПопытки/РезультатПопытки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РезультатПопытки</name>
  <posting>Deny</posting>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПопытки</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>РевизияРезультата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНазначения</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.КандидатыВнешние</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКандидатаСнимок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тест</name>
    <type>
      <types>CatalogRef.Тесты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияТеста</name>
    <type>
      <types>CatalogRef.ВерсииТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХэшВерсииТеста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗавершения</name>
    <type>
      <types>EnumRef.СпособыЗавершенияПопытки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроверки</name>
    <type>
      <types>EnumRef.СтатусыПроверкиПопытки</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатПрохождения</name>
    <type>
      <types>EnumRef.РезультатыПрохождения</types>
    </type>
  </attributes>
  <attributes>
    <name>НабраноБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимумБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПравильныхОтветов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроходнойБаллСнимок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьСекунд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХэшИсходногоСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсходноеСообщение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ответы</name>
    <attributes>
      <name>ИдентификаторОтвета</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокВПопытке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВопросВерсии</name>
      <type>
        <types>CatalogRef.ВопросыВерсийТестов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстВопросаСнимок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОтветаСнимок</name>
      <type>
        <types>EnumRef.ТипыОтветов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстовыйОтвет</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветДан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусПроверки</name>
      <type>
        <types>EnumRef.СтатусыПроверкиОтвета</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветПравильный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НабраноБаллов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальныйБалл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийПроверки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВариантыОтветов</name>
    <attributes>
      <name>ИдентификаторОтвета</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОтветаВерсии</name>
      <type>
        <types>CatalogRef.ВариантыОтветовВерсий</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторВерсииВарианта</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокВПопытке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстВариантаСнимок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BellerageHackathon/src/Documents/РезультатПопытки/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Элементы.РучнаяПроверка.Видимость = ПравоДоступа("Изменение", Метаданные.Документы.РезультатПопытки);
КонецПроцедуры

&НаКлиенте
Процедура ПринятьОтвет(Команда)
    ПроверитьТекущийОтвет(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьОтвет(Команда)
    ПроверитьТекущийОтвет(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьТекущийОтвет(Принят)
    Строка = Элементы.Ответы.ТекущиеДанные;
    Если Строка = Неопределено Тогда Возврат; КонецЕсли;
    ПроверитьНаСервере(Строка.ИдентификаторОтвета, Принят);
    КомментарийРецензента = "";
    Прочитать();
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере(ИдентификаторОтвета, Принят)
    РабочееМестоТестированияСервер.ПроверитьОтветВручную(Объект.Ссылка, ИдентификаторОтвета, Принят, КомментарийРецензента);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
    Прочитать();
КонецПроцедуры
